app/controllers/reservations_controller.rb

  def edit
    @reservation = Reservation.find(params[:id])
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @reservation = Reservation.new(reservation_params)

    if @reservation.save
---
INSERT INTO "reservations" ("title", "text", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Sonny"], ["text", "fda"], ["time", "5pm @ 5/19/2017"], ["created_at", 2017-05-18 04:48:35 UTC], ["updated_at", 2017-05-18 04:48:35 UTC]]

  def destroy
    @reservation = Reservation.find(params[:id])
    @reservation.destroy
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 1]]